IDC_GUSBP_FRAME_METHOD                        = "Design Method"
IDC_GUSBP_RDO_EAM                             = "Equivalent T-stub Method"
IDC_GUSBP_RDO_FEM                             = "Finite Element Method"

IDC_GUSBP_FRM_WELD                            = "Welding"
IDC_GUSBP_CHK_WELD                            = "Check Welding"
IDC_GUSBP_LBL_WELD_TT                         = "Throat Thickness"
IDC_GUSBP_LBL_WELD_LX                         = "Effective Length ( X )"
IDC_GUSBP_LBL_WELD_LY                         = "Effective Length ( Y )"
IDC_GUSBP_LBL_WELD_LT                         = "Effective Length ( Tension )"

IDC_GUSBP_FRAME_FACTOR                        = "Factor of Bolt Hole"
IDC_STATIC_BOLT_HOLE_FACT_TEXT                = "Bearing Resistance Factor"

IDC_GUSBP_LABEL_GROUT_THK                     = "Grout"

/////// ESMC : EUROCODE Steel : Moment Bolt Connection
/////// IDD_ESMC_PMODE_DLG
IDC_GESMC_FRM_GNRL                            = "General"
IDC_GESMC_LBL_NAME                            = "Member Name"
IDC_GESMC_LBL_MUSE                            = "Apply this member to "
IDC_GESMC_CHK_DRAW_DIMS                       = "Draw Dimension"
IDC_GESMC_CHK_DIMS_ONLY                       = "Dimension"
IDC_GESMC_RDO_DISP_TOTL                       = "Total"
IDC_GESMC_RDO_DISP_PLAN                       = "Plan"
IDC_GESMC_RDO_DISP_ELEV                       = "Elevation"
IDC_GESMC_RDO_DISP_SIDE                       = "Side"
IDC_GESMC_FRM_BOLT_PROP                       = "Bolt Property"
IDC_GESMC_FRM_SROW_TYPE                       = "Shear Row Designation"
IDC_GESMC_RDO_SROW_USER                       = "Specify manually"
IDC_GESMC_RDO_SROW_AUTO                       = "Determine by Program"
IDC_GESMC_LBL_BOLT_MATL                       = "Material"
IDC_GESMC_LBL_BOLT_NAME                       = "Name"
IDC_GESMC_LBL_BOLT_TYPE                       = "Type"
IDC_GESMC_RDO_BOLT_ORDI                       = "Ordinary"
IDC_GESMC_RDO_BOLT_COUN                       = "Countersunk"
IDC_GESMC_LBL_BOLT_LAYO                       = "Layout"
IDC_GESMC_RDO_LAYO_USER                       = "User"
IDC_GESMC_RDO_LAYO_AUTO                       = "Auto"
IDC_GESMC_FRM_BOLT_FACT                       = "Bolt Factor"
IDC_GESMC_LBL_FACT_SLIP                       = "Slip Factor"
IDC_GESMC_FRM_BOLT_LAYO                       = "Bolt Layout"
IDC_GESMC_FRM_RSLT                            = "Calculation Result"
IDC_GESMC_BOLT_LAYOUT_AUTO                    = "Bolt Layout ( Automatic )"
IDC_GESMC_BOLT_LAYOUT_USER                    = "Bolt Layout ( Manual )"
IDC_GESMC_FRM_BOLT_PREV                       = "Preview"

/////// IDD_ESMC_LAYOUT_AUTO_DLG
IDC_GESMC_FRM_ROWS                            = "Rows && Columns"
IDC_GESMC_LBL_ROWS_COLM                       = "Columns"
IDC_GESMC_LBL_ROWS_TOP                        = "Rows ( Top )"
IDC_GESMC_LBL_ROWS_BOT                        = "Rows ( Bot. )"
IDC_GESMC_LBL_ROWS_TOP_TENS                   = "Rows ( Top, Tens. )"
IDC_GESMC_LBL_ROWS_BOT_SHEAR                  = "Rows ( Bot., Shear )"
IDC_GESMC_FRM_LENG                            = "Length"
IDC_GESMC_LBL_EXTNS_HOR                       = "Extension ( Hor. )"
IDC_GESMC_LBL_EXTNS_VER                       = "Extension ( Ver. )"
IDC_GESMC_LBL_EXTNS_TOP                       = "Extension ( Top )"
IDC_GESMC_LBL_EXTNS_BOT                       = "Extension ( Bot. )"
IDC_GESMC_LBL_SPACE_HOR                       = "Spacing ( Hor. )"
IDC_GESMC_LBL_SPACE_VER                       = "Spacing ( Ver. )"
IDC_GESMC_LBL_SPACE_OFF                       = "Offset"
IDC_GESMC_CHK_SPACE_OFF                       = "Consider Girder Web Thickness"

/////// IDD_ESMC_LAYOUT_USER_LIST_DLG
IDD_ESMC_LAYOUT_USER_LIST_DLG                 = "Bolt Layout ( User Type )"
IDC_GESMC_FRM_SEL                             = "Select Member"

/////// IDD_ESMC_LAYOUT_USER_DLG
IDC_GESMC_FRM_TOP                             = "Top"
IDC_GESMC_FRM_BOT                             = "Bot."
IDC_GESMC_FRM_TOP_TENS                        = "Top ( Tens. )"
IDC_GESMC_FRM_BOT_SHEAR                       = "Bot. ( Shear )"

/////// IDD_ESMC_USER_SPACE_DLG
IDC_GESMC_BTN_ADD                             = "Add"
IDC_GESMC_BTN_INS                             = "Insert"
IDC_GESMC_BTN_DEL                             = "Delete"
IDC_GESMC_BTN_RES                             = "Reset"

/////// IDD_ESMC_GIRD_DLG
IDC_GESMC_FRM_GIRD                            = "Number of Girder"
IDC_GESMC_RDO_GIRD_SID1                       = "Single Girder ( 1 Side )"
IDC_GESMC_RDO_GIRD_SID2                       = "Double Girder ( 2 Sides )"
IDC_GESMC_FRM_PLAT                            = "End Plate"
IDC_GESMC_LBL_PLAT_MATL                       = "Material"
IDC_GESMC_LBL_PLAT_THCK                       = "Thickness"
IDC_GESMC_LBL_PLAT_WIDT                       = "Width"
IDC_GESMC_LBL_PLAT_EXTT                       = "Extension ( Top )"
IDC_GESMC_LBL_PLAT_EXTB                       = "Extension ( Bot. )"

/////// IDD_ESMC_GIRD_SECT_DLG
IDC_GESMC_FRM_SECT                            = "Section"
IDC_GESMC_FRM_ANGL                            = "Angle"
IDC_GESMC_LBL_ANGL                            = "Angle"
IDC_GESMC_FRM_MATL                            = "Material"
IDC_GESMC_LBL_MATL                            = "Material"
IDC_GESMC_FRM_WELD                            = "Leg Length"
IDC_GESMC_LBL_WEBT                            = "Web"
IDC_GESMC_LBL_FLGT                            = "Flange"

/////// IDD_ESMC_COLM_DLG
IDC_GESMC_FRM_COLM                            = "Number of Column"
IDC_GESMC_RDO_COLM_SID1                       = "Single Column ( Lower Only )"
IDC_GESMC_RDO_COLM_SID2                       = "Double Columns ( Lower + Upper )"
IDC_GESMC_FRM_FACT                            = "Reduction Factor ( Kwc )"
IDC_GESMC_LBL_TYPE                            = "Type"
IDC_GESMC_LBL_FACT                            = "Factor"
IDC_GESMC_TOOLTIP_REDUCT_FACT_KCW             = "Reduction factor that takes account of compression in column web"

/////// IDD_ESMC_BRCK_SECT_DLG
IDC_GESMC_CHK_BRCK                            = "Use Bracket"
IDC_GESMC_FRM_TYPE                            = "Type"
IDC_GESMC_FRM_SIZE                            = "Size"
IDC_GESMC_LBL_LENG                            = "Length"
IDC_GESMC_LBL_HEI1                            = "Height1"
IDC_GESMC_LBL_HEI2                            = "Height2"
IDC_GESMC_FRM_CLAS                            = "Combined Section Class"
IDC_GESMC_LBL_CLAS                            = "Sect. Class"
IDC_GESMC_LBL_SECZ                            = "Sect. Modulus"

/////// IDD_ESMC_STIF_DLG
IDC_GESMC_FRM_TOP_FLNG                        = "Top Flange"
IDC_GESMC_CHK_TOP_APPL                        = "Use Stiffener"
IDC_GESMC_LBL_TOP_MATL                        = "Material"
IDC_GESMC_LBL_TOP_THCK                        = "Thickness"
IDC_GESMC_LBL_TOP_WIDT                        = "Width"
IDC_GESMC_LBL_TOP_CORN                        = "Corner Width"
IDC_GESMC_FRM_BOT_FLNG                        = "Bottom Flange"
IDC_GESMC_CHK_BOT_APPL                        = "Use Stiffener"
IDC_GESMC_LBL_BOT_MATL                        = "Material"
IDC_GESMC_LBL_BOT_THCK                        = "Thickness"
IDC_GESMC_LBL_BOT_WIDT                        = "Width"
IDC_GESMC_LBL_BOT_CORN                        = "Corner Width"
IDC_GESMC_FRM_WEB                             = "Column Web"
IDC_GESMC_CHK_WEB_APPL                        = "Use Stiffener"
IDC_GESMC_LBL_WEB_TYPE                        = "Type"
IDC_GESMC_LBL_WEB_MATL                        = "Material"
IDC_GESMC_LBL_WEB_THCK                        = "Thickness"
IDC_GESMC_LBL_WEB_WIDT                        = "Width"
IDC_GESMC_LBL_WEB_HEIG                        = "Height"
IDC_GESMC_LBL_WEB_SIDE                        = "Side No."

/////// IDD_ESMC_FORC_UNIT_DLG
IDC_GESMC_LBL_FX                              = "Axial"
IDC_GESMC_LBL_MX                              = "Moment ( X )"
IDC_GESMC_LBL_MY                              = "Moment ( Y )"
IDC_GESMC_LBL_VX                              = "Shear ( X )"
IDC_GESMC_LBL_VY                              = "Shear ( Y )"

/////// IDD_ESMC_BRCK_PLAT_DLG
IDC_GESMC_LBL_THCK                            = "Thickness"

/////// IDD_ESMC_LOAD_COMB_DLG
IDD_ESMC_LOAD_COMB_DLG                        = "Load Combinations"
IDC_GESMC_LCOM_BTN_ALL                        = "All"
IDC_GESMC_LCOM_BTN_NON                        = "None"
IDC_GESMC_LCOM_BTN_INV                        = "Invert"
IDC_GESMC_LCOM_BTN_ADD                        = "Add"
IDC_GESMC_LCOM_BTN_INS                        = "Insert"
IDC_GESMC_LCOM_BTN_DEL                        = "Delete"
IDC_GESMC_LCOM_BTN_OK                         = "OK"
IDC_GESMC_LCOM_BTN_CANCEL                     = "Cancel"

/////// IDD_ESSG_SMODE_INPUT_SECT1_DLG
IDC_GESSG_FRAME_MATERIAL                      = "Material"     
IDC_GESSG_LABEL_MATERIAL     				  =	"Material"
IDC_GESSG_FRAME_MEMBER       				  =	"Member Type"
IDC_GESSG_RADIO_MEMBER_BEAM  				  =	"Beam"
IDC_GESSG_RADIO_MEMBER_COLUMN				  =	"Column"
IDC_GESSG_FRAME_SECTION      				  =	"Section"

/////// IDD_ESSG_SMODE_INPUT_SECT2_DLG
IDC_GESSG_FRAME_FORCE                         = "Force && Factor" 
IDC_GESSG_LABEL_FORCE_AXIAL					  =	"Axial"
IDC_GESSG_LABEL_FORCE_MX   					  =	"Moment (x)"
IDC_GESSG_LABEL_FORCE_MY   					  =	"Moment (y)"
IDC_GESSG_LABEL_FORCE_VX   					  =	"Shear (x)"
IDC_GESSG_LABEL_FORCE_VY   					  =	"Shear (y)"
IDC_GESSG_LABEL_FORCE_TORSION                 = "Torsion"
IDC_GESSG_LABEL_FACTOR_C1                     =	"C1"
IDC_GESSG_LABEL_FACTOR_C2                     =	"C2"
IDC_GESSG_RDO_ANX_A                           =	"kij Method 1 - Annex A"
IDC_GESSG_RDO_ANX_B        					  =	"kij Method 2 - Annex B"
IDC_GESSG_LABEL_FACTOR_CMX                    =	"Cmx"
IDC_GESSG_LABEL_FACTOR_CMY 					  =	"Cmy"
IDC_GESSG_LABEL_FACTOR_CMLT					  =	"CmLT"
IDC_GESSG_INPUT_BTN_LCOMB                     =	"Load Combinations"
IDC_GESSG_FRAME_LENGTH                        = "Length"
IDC_GESSG_LABEL_LENGTH_LX  					  = "Lx"
IDC_GESSG_LABEL_LENGTH_LY  					  = "Ly"
IDC_GESSG_LABEL_LENGTH_LT  					  = "Lt"
IDC_GESSG_LABEL_LENGTH_LB  					  = "Lb"
IDC_GESSG_LABEL_LENGTH_KX  					  = "kx"
IDC_GESSG_LABEL_LENGTH_KY  					  = "ky"
IDC_GESSG_FRAME_PROPERTY                      = "Section Property"
IDC_GESSG_FRAME_RESULT                        = "Calculation Result"